#KQL

Activity from suspicious folders

DeviceProcessEvents
| where FolderPath has @"\spool\drivers\color\"
| project Timestamp, DeviceName, AccountName,, FileName, FolderPath, InitiatingProcessFileName



